Table of Contents
 Interface IIdeaNegativePlate
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
An negative plate is a part of a connection.
public interface IIdeaNegativePlate : IIdeaPlate, IIdeaObjectConnectable, IIdeaPersistentObject, IIdeaObject
Inherited Members
 IIdeaPlate.Thickness
 IIdeaPlate.Material
 IIdeaPlate.Origin
 IIdeaPlate.LocalCoordinateSystem
 IIdeaPlate.Geometry
 IIdeaPersistentObject.Token
 IIdeaObject.Id
 IIdeaObject.Name
 Edit this page